Revit 2027 API
ExporterIFCUtils.SetGlobal2DDirectionHandles Method
 Sets the handles representing the cardinal directions in 2D.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void SetGlobal2DDirectionHandles(
	bool positive,
	IFCAnyHandle xDir,
	IFCAnyHandle yDir
)
Public Shared Sub SetGlobal2DDirectionHandles (
	positive As Boolean,
	xDir As IFCAnyHandle,
	yDir As IFCAnyHandle
)
public:
static void SetGlobal2DDirectionHandles(
	bool positive,
	IFCAnyHandle^ xDir,
	IFCAnyHandle^ yDir
)
static member SetGlobal2DDirectionHandles :
        positive : bool *
        xDir : IFCAnyHandle *
        yDir : IFCAnyHandle -> unit
Parameters
positive Boolean
 True if the handles returned should be in the positive direction, false if the handles should be in the negative direction.
xDir IFCAnyHandle
 The X direction handle.
yDir IFCAnyHandle
 The Y direction handle.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace